export const DeliveryText = [
  {
    title: "Тестирование товара",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        На странице с нашими контактами указан адрес склада. Перед покупкой вы
        можете испытать каждый станок на складе, взяв с собой образцы кабеля,
        которые вы бы хотели разделывать.
      </h4>
    ),
  },
  {
    title: "Доставка",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        Доступны следующие способы доставки: <br /> <br />– Транспортной
        компанией По всей России (оплата при получении)
        <br />– Почтовыми отправлениями (до 10кг) По всей России (оплата
        при получении)
        <br />– Самовывоз со склада <br />– Курьером по Москве и МО
      </h4>
    ),
  },
  {
    title: "Оплата",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        Оплата возможна следующими способами:
        <br />
        <br />– Наложенным платежом, т.е. вы оплачиваете при получении
        (если груз был отправлен Транспортной компанией или Почтой России)
        <br />– Наличными при самовывозе и доставке в пределах Москвы и Области
        <br />– Банковским переводом* (для юр. лиц)
        <br />
        <br /> * После выставления счета и подтверждения нашими менеджерами
        его оплаты, вы получаете товар любым вышеперечисленным способом со всеми
        сопроводительными документами.
      </h4>
    ),
  },
];

export const GatantedText = [
  {
    title:
      "Условия и срок , при которых осуществляется гарантийное обслуживания товара",
    subtitle: (
      <h4 className="text-base text-textBlack ">
        При покупке товара с нашего сайта предоставляется гарантия сроком, как
        правило, до 1 года (со дня приобретения товара). Основанием для
        предоставления гарантийного обслуживания служит гарантийный талон или
        товарная накладная, который покупатель получает при приобретении товара
        и в которой прописан срок гарантии в определенной строке. На протяжении
        всего периода эксплуатации наше представительство предоставляет
        техническую поддержку поставляемого оборудования, так же у нас вы можете
        приобрести комплектующие и запасные части к оборудованию.
      </h4>
    ),
  },
  {
    title: "Гарантийный ремонт не предоставляется в следующих случаях:",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        – в товаре есть механические, термические или электрические поломки
        (сюда относятся и скрытые); <br />– когда в товаре имеются какие <br />
        –либо повреждения по причине неаккуратного обращения пользователя;{" "}
        <br />– в изделии есть признаки попадания внутрь веществ, каких-то
        предметов или жидкостей; <br />– техника вышла из строя из-за применения
        несовместимых комплектующих, неподходящих расходных материалов; <br />–
        на товаре есть повреждения, которые были вызваны стихийным бедствием,
        пожаром или какими-то бытовыми факторами;
        <br /> – товар был поврежден при перевозке, хранении или нарушались
        правила его эксплуатации;
        <br /> – если есть элементы с признаками перегрева;
        <br /> – есть признаки того, что сделано вмешательство в строение
        устройства.
      </h4>
    ),
  },
  {
    title: "Обмен товара",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        При обнаружении недостатков заводского характера, обмен товара возможен
        на протяжении четырнадцати дней (без учета дня приобретения товара).
        Продавец обязан осуществить замену товара в течение семи дней с момента
        обращения покупателя.
      </h4>
    ),
  },
  {
    title: "Обмен продукции возможен в следующих случаях:",
    subtitle: (
      <h4 className="text-base text-textBlack  ">
        – товар не использовался; <br />– товар имеет надлежащий товарный вид;
        <br /> – не повреждены его первоначальные качества;
        <br /> – на своих местах находятся фабричные ярлыки, а также
        <br /> – все пломбы на – своих местах и не нарушены;
        <br />– покупатель имеет при себе товарный чек или накладную.
      </h4>
    ),
  },
];
